[{"Id":"33e0587c-bf4f-4484-8b71-92d8df85e437","Type":"coc","Title":"Code of Conduct","Message":"• Everyone must be treated with respect. There will be absolutely no harassment, persecutions, sexism, racism, or hate speech.  Any transgressions will not be tolerated.\n• No illegal activities. Including but not limited to, RMT (Real Money Trading), pirating, illicit drugs and illicit transactions.\n• Botting. This is defined as creating macros/scripts/etc that allows an account to automatically, including but not limited to: timers, triggers from ingame event, triggers from Ravenfall bot messages, etc. This include using any of the public bots.\n• Intentional abuse of exploits. Using bugs, or loopholes that's not within the idea of the feature to gain an advantage over others players or used to harass other players.\n      ? Discovery and prompt reporting of bugs will not be punished. Report all bugs found, and their use.\n\n<i>Ravenfall is a community focus game and we ask to you to consider other players both within your game and Ravenfall as a whole when making use of the below rules or exceptions.</i>\n\n• Some macros, scripts are allowed for accessibility. Some examples are:\n      ? Voice command to send training command to all characters\n      ? A command that can be typed up by another member of the stream to join your character\n      ? Using Channel Points To Trigger gifting of an armour set.\n\n • The idea is to give accessibility options for people who need extra help, such as someone who have; \n      ?  Visual Impairment\n      ? Typing Impairment \n      ? Hearing Impairment\n      ? Other / Etc\n\n• Bug Hunting to improve or debug the game. Tracking bugs, using exploits or bugs to find other bugs or in a way that deemed to increase enjoyment of the game without increasing advantage over other players. \n\nIf Ravenfall Staff has deemed, that the player has broken the rules or that the player is acting in a way that damaging to the community of Ravenfall, action will be taken against the player.\n\nAction may be taken against a player at anytime, with penalties being taken account of severity and previous actions taken upon the individual / group.  These actions includes but are not limited to:\n      ? Informal Warning \n      ? Written Warning \n      ? Timed or Permanent Ban. \n\nWe strive to allow all playstyle of the game within the confined of the game as such, we may reach out to other players or group of players to resolve a situation before any action is taken. Final decision rest with the Ravenfall Staff and we reserve the right to keep or share any actions and details taken as deemed necessary. \n\nAction taken by Ravenfall Staff, is considered final but appeal may be made through Ravenfall Discord or via email to <color=red>abuse@ravenfall.stream</color>","ValidFrom":"2022-01-05T21:37:52","ValidTo":null,"LastModified":"2022-01-16T11:38:00","Revision":11,"VisibleInClient":true}]